#На мою думку, на прийменникові вирази впливає неоднозначність. Наприклад,
#є два речення:
#The policeman saw a burglar with a gun. (побачив саме цього грабіжника)
#The policeman saw a burglar with a telescope. (побачив грабіжника за допомогою телескопа)
#У двох реченнях є прийменниковий вираз, який починається зі слова with.
#У першому випадку, слово with, змінює іменник burglar (грабіжник), а у другому
#дієслово saw (бачив).  Через такі неоднозначності, структура дерева змінюється
#докорінно. 
