#Однією з проблем композиційного аналізу є семантична неоднозначність. Як правило така неоднозначність виникає в наслідок кванторних слів (кількісний числівник, прислівник, прийменникових враз, заперечення і тд.).
#Наприклад, неоднозначність в реченні ‘Every student took a course’, неясно чи був то один конкретний курс, взятий одним кожним студентом чи кожен студент взяв принаймні один курс, але не обов’язково один і той самий. Тому, пропонується підхід, який допомагаю вирішити такі проблеми за допомогою додаткових правил, які ефективно перерозподіляють кванторні слова у синтаксичний аналіз.
##Цей підхід можна продемонструвати на наступному реченні: ‘Every man loves a woman.’
#Представлення цього речення натсупне:
  

 

#В цьому прикладі, якщо спочатку ми висунемо 6 на передній план, то отримаємо: 

 
