# fine
#

#“Puerto Rican teen named mistress of the Universe”
#Промарковане речення:
#Puerto/NP Rican/JJ-TL teen/NN named/VBN mistress/NN of/IN the/AT Universe/NN-TL
#Тут слово mistress в значенні володарка, а не коханка. Усунути неоднозначності в цьому реченні не вдалося, а все це через те, що “володарка” і “коханка” належить до однієї і тієї ж частини мови. Тут все залежить від здатності читача вибирати потрібне значення слова mistress в цьому контексті.

#“Include your children when baking cookies”
#Промарковане речення:
#Include/VB your/PP$ children/NNS when/WRB baking/VBG cookies/NNS
#Include в значенні процесу. Мається на увазі, що вам слід залучати ваших дітей у процес випічки печива, а не те, що печиво повинно містити вашу дитину, як один із інгредієнтів. Усунути неоднозначності в цьому реченні не вдалося, бо слова “залучати” і “мати у своєму складі” належить до однієї і тієї ж частини мови (дієслово).

#“Reagan wins on budget, but more lies ahead”
#Промарковане речення:
#Reagen/NP wins/VBZ on/IN budget/NN ,/, but/CC more/QL lies/VBZ ahead/RB 
#В даному контексті, щоб уникнути неоднозначності слово lies повинно бути промарковане як дієслово. Адже, якщо слово буде виступати в реченні як іменник, то ми отримуємо more lies (більше брехні), що не пасує в даному контексті. 
