question1=('Question:')
print question1
question=('Прочитати про один з класифікаторів, який згадується в цьому розділі: word sense disambiguation, semantic role labeling, question answering, machine translation або named entity recognition. Які дані необхідні для побудови класифікатора? Чому необхідний великий об’єм даних для вирішення задачі?')
print question
answer1=('Answer:')
print answer1
answer=('Велике значення має контекст вживання того чи іншого слова. У книзі ( Розділ1.Word Sense Disambiguation) дано два слова serve та dish та значення в яких вони вживаються. Значень було подано декілька, але був і такий випадок, коли ці два слова складали спільний вираз. Такі слова належать до різних стилів, вони мають зовсім різні значення, тому важко зрозуміти вираз в якому вони вживаються. Головним завданням цього класифікатора є усунення неоднозначності слів використовуючи контекст враховуючи той факт, що слова, які знаходяться поряд мають схожі і пов’язані значення. Отже, важливим є знаходження різних значень слова, контекст, тому для вирішення задачі необхідний великий об’єм даних.')
print answer
