#a
#На мою думку, використовуючи Lookup Tagger без backoff знижує ефективність
#аналізатора і робить його менш точним. Це ми можемо помітити на графах.
#На першому графі (Lookup Tagger без backoff) performance задано довшими
#інтервалами, ніж на другому (Lookup Tagger з backoff на DefaultTagger('NN')).
#Другий граф є більш точнішим, адже там інтервал складає 0,1, в той час,
#як на першому графі – 0,2.
#b
#Я вважаю, що розмір Lookup Tagger`а залежить від мети його використання.
#Наприклад, нам необхідно провести глибоке дослідження і задати якусь певну
#модель пошуку. Звісно, в цьому випадку нам необхідно використовувати
#великий розмір(16 000) Lookup Tagger`а і ми не будемо зважати на продуктивність
#роботи, адже нам необхідно отримати результат. В іншому випадку, якщо ми хочемо
#швидко переглянути, як саме діє Lookup Tagger, то нам зовсім не обовз`яково
#використовувати великий розмір даних. Адже, навіть на сучасних комп’ютерах,
#обробка Lookup Tagger’ом даних займає досить тривалий час. 
