#Прокулевич К. ПРЛс-11, задача№1 розділ6
#Для того, щоб класифікатор правильно визначив тег для слова потрібно задати певні характеристики для слова.
#Часто кількість характеристик, які ви можете задати алгоритму є обмеженою.
#Важливе значення, наприклад для визначення до якої частини мови належить слово, має контекст.
#Це можна побачити на прикладі consecutive classification(послідовна класифікація).
#Її принцип полягає в тому, що спершу визначається тег для пенршого слова, а вже після цього послідовно до кожного наступного слова, звертаючи увагу на попередній тег.
#Для такого класифікатора потрібний великий об'єм даних для того, щоб правильно визначити якою частиною мови виступає слово в тексті.
