# Presented by Olha Truniak, ALs-13
# Chapter 7, Ex.1

# The IOB format categorizes tagged tokens as I, O, and B. Why are three tags
# necessary? What problem would be caused if we used I and O tags exclusively?

print "Дані 3 типи семантичного сегментування (chunk) є необхідними, тому що вони, перш за все, визначають розташування власне протегованих слів (слово+його тег) у відношенні до семантично-сегментованої структури у реченні; і по-друге, це є найзручніший спосіб представлення семантично-сегментованої структури у файлі, де у кожному рядочку виводиться лише слово, відповідна частина мови та відповідна семантично-сегментована структура, а це, в свою чергу, дає можливість представяти більш, ніж 1 семантично-сегментовану структуру. Якщо ж ми використаємо винятково лише І або О теги,то отримаємо перервану семантично-сегментовану структуру, яку не можна буде представити у файлі."
