# Shylimova K. Al-13
# Chapter 7, task 1

print 'Дані 3 типи семантичного сегментування (chunk) є необхідними, тому що вони, перш за все, визначають розташування власне протегованих слів (слово+його тег) у відношенні до семантично сегментованої структури у реченні; і по-друге, це є найзручніший спосіб представлення семантично сегментованої структури у файлі, де у кожному рядку виводиться лише слово, відповідна частина мови та відповідна семантично сегментована структура, а це, в свою чергу, дає можливість представити більше, ніж 1 семантично сегментовану структуру. Якщо ж ми використаємо винятково І або О теги, то отримаємо перервану семантично сегментовану структуру, яку не можна буде представити у файлі.' 
