# Chapter_6_Ex_1_Mokhonova

# B обробці природної мови проблемною областю є усунення лексичної багатозначності слів.
# Є багато підходів до вирішення даної проблеми, але найкращим є залучення
# керівних методів для тренування тегів з використанням анотованого корпусу.
# Потрібно багато анотованих даних для розробки такого програмного забезпечення через
# складність проблеми та різні контексти, в яких може зустрічатися слово.
# Стосовно тегування частини мови, то чим більше даних бачить тег у тренуванні,
# тим вищою буде його точність при обробці нових даних.
