# fine
import nltk
text=nltk.word_tokenize("They wind back the clock, while we chase after the wind. ")
nltk.pos_tag(text)
# В задачі 3 я виконала необхідне завдання за допомогою фунції POS tagger.За її допомогою я розглянула послідовність слів,а також надала кожному слову тег,в якому вказано до якої частини мови це слово належить.У даному реченні слово "wind" вживається два рази і має різні значення,а також належить до різних частин мови.У першому випадку слово "wind" є дієсловом теперішнього часу (VBP) і означає "переводити назад".В другому випадку слово "wind" є іменником(N) і означає "вітер".Це слово,як і багато інших може вживатися як іменник і дієслово,навіть не змінюючи наголосу.Це слово не є омофоном.
